{
  "irVersion": "4",
  "producerName": "tf2onnx",
  "producerVersion": "1.8.5",
  "graph": {
    "node": [
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/conv_kernel/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/conv_kernel/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/conv_kernel/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/conv_kernel/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/final_block/logits_13class/conv2d_23/bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/conv_kernel:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Pad:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/down5/conv2d_12/Pad",
        "opType": "Pad",
        "attribute": [
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_2/conv2d_11/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block5/conv5_1/conv2d_10/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/conv_kernel:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Pad:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/down4/conv2d_9/Pad",
        "opType": "Pad",
        "attribute": [
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_2/conv2d_8/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block4/conv4_1/conv2d_7/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/conv_kernel:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Pad:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/down3/conv2d_6/Pad",
        "opType": "Pad",
        "attribute": [
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_2/conv2d_5/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2/ReadVariableOp:0",
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/Cast:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "2",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/GatherV2:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block3/conv3_1/conv2d_4/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/bn_folding_bias/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/bn_folding_bias/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/bn_folding_bias/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/bn_folding_bias/ReadVariableOp:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/bn_folding_bias:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/bn_folding_bias",
        "opType": "Identity"
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/conv_kernel:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/Pad:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/down2/conv2d_3/Pad",
        "opType": "Pad",
        "attribute": [
          {
            "name": "pads",
            "ints": [
              "1",
              "1",
              "0",
              "0",
              "0",
              "0",
              "0",
              "0"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/conv2_1/conv2d_2/conv_kernel/ReadVariableOp/resource:0"
        ],
        "output": [
          "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/conv2_1/conv2d_2/conv_kernel/ReadVariableOp:0"
        ],
        "name": "TrainModel/TrainModel/ProcessingHandler/student_semantic_segmentation_model/encoder_block2/conv2_1/conv2d_2/conv_kernel/ReadVariableOp",
        "opType": "ReadVariableOp",
        "attribute": [
          {
            "name": "dtype",
